app/controllers/admin_controller.rb

SELECT count(*) AS count_all FROM "users"
---
  def login
    if request.post?
      if User.count.zero?

SELECT count(*) AS count_all FROM "orders"
---
  def index
    @total_orders = Order.count