app/controllers/store_controller.rb

SELECT * FROM "products" ORDER BY title
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM "products" WHERE ("products"."id" = 3)
---
  def add_to_cart
    product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 0)
---
  def remove_from_cart
    product = Product.find(params[:id])

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2009-06-26 08:08:00', 3, 1, 5, 29.95, '2009-06-26 08:08:00')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('Dave Thomas', '123 Main St', '2009-06-26 08:08:00', '2009-06-26 08:08:00', 'cc', 'customer@pragprog.com')
---
  def checkout
    @in_checkout = true
    if @cart.items.empty?
      redirect_to_index("Your cart is empty")
    elsif request.post? && params[:order] != nil
      @order = Order.new(params[:order])
      @order.add_line_items_from_cart(@cart)
      if @order.save