app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" = -1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('test', 'test', '2009-06-26 04:27:24', '2009-06-26 04:27:24', 'test')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "users" SET "updated_at" = '2009-06-26 08:01:59', "salt" = '194394800.545728576393265', "hashed_password" = 'd79b3260e8d9d1abb2b5fade655f92f34c932359' WHERE "id" = 3

  def destroy
    @user = User.find(params[:id])
    begin
      flash[:notice] = "User #{@user.name} deleted."
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = -1) LIMIT 1
DELETE FROM "users" WHERE "id" = 1